@push('title')Продажа недвижимости, юридические услуги@endpush

@push('description')Хочешь быстро продать недвижимость или воспользоваться качественными юридичскими услугами? Вы попали по адресу, опыт более 10 лет@endpush


@push('keywords')Продажа, аренда, выкуп, договоры, представительство в суде@endpush


@push('og:url'){{url()->current()}}@endpush
@push('og:title')Продажа недвижимости, юридические услуги@endpush
@push('og:description')Хочешь быстро продать недвижимость или воспользоваться качественными юридичскими услугами? Вы попали по адресу, опыт более 10 лет.@endpush

@push('og:image'){{ asset('images/image_contacts.jpeg')}}@endpush


